smartcartech/SmartCarTech_Web/ate-automation/src/ESP32_3USB_3DLC_OTA_v03.00.04.cpp
            if (pin != -1) {
              int keyNum = pin + 1;
              lcd.setCursor(0, 2); lcd.print("Testing Key "); 
              if (keyNum < 10) lcd.print(" "); lcd.print(keyNum); lcd.print("...   ");
              mcp.digitalWrite(pin, LOW); delay(200);
              mcp.digitalWrite(pin, HIGH); delay(200);
              lcd.setCursor(0, 2); lcd.print("Waiting PC Command..");
            }
          }
        }
        
        else if (cmdBuffer[1] == 0x00 && cmdBuffer[2] == 0x04) {
          if (cmdBuffer[3] == 0x02) {
            runStep = 7; 
            lcd.setCursor(0, 2); lcd.print("Changing Tool...");
          }
          else if (cmdBuffer[3] == 0x00) {
            safeStopAll();
            lcd.clear();
            printCentered(0, "SYSTEM RUN (PC)");
            lcd.setCursor(0, 1); lcd.print("Tool: "); lcd.print(currentPair + 1); 
            lcd.setCursor(0, 2); lcd.print("Waiting PC Command..");
            lcd.setCursor(0, 3); lcd.print("Press RUN to Stop");
            runStep = 6; 
          }
        }

        else if (cmdBuffer[1] >= 0x01 && cmdBuffer[1] <= 0x03) {
          int toolIndex = cmdBuffer[1] - 1; 
          int toolNum = cmdBuffer[1];       
          
          if (cmdBuffer[2] == 0x02) {
            if (cmdBuffer[3] == 0x00) { 
              lcd.setCursor(0, 2); lcd.print("Disconnect USB "); lcd.print(toolNum); lcd.print("... ");
              usbServos[toolIndex].attach(USB_SERVO_PINS[toolIndex]); 
              usbServos[toolIndex].write(usbAngleA[toolIndex]);             
              delay(600); 
              detachServoSafe(toolIndex);
              lcd.setCursor(0, 2); lcd.print("Waiting PC Command..");
            } 
            else if (cmdBuffer[3] == 0x01) { 
              lcd.setCursor(0, 2); lcd.print("Connect USB "); lcd.print(toolNum); lcd.print("...    ");
              usbServos[toolIndex].attach(USB_SERVO_PINS[toolIndex]); 
              usbServos[toolIndex].write(usbAngleB[toolIndex]);             
              delay(600); 
              detachServoSafe(toolIndex);
              lcd.setCursor(0, 2); lcd.print("Waiting PC Command..");
            }
          }
          else if (cmdBuffer[2] == 0x03) {
            if (cmdBuffer[3] == 0x00) { 
              lcd.setCursor(0, 2); lcd.print("Disconnect DLC "); lcd.print(toolNum); lcd.print("... ");
              mcp.digitalWrite(DLC_RELAY_PINS[toolIndex], HIGH); 
              delay(200);
              lcd.setCursor(0, 2); lcd.print("Waiting PC Command..");
            } 
            else if (cmdBuffer[3] == 0x01) { 
              lcd.setCursor(0, 2); lcd.print("Connect DLC "); lcd.print(toolNum); lcd.print("...    ");
              mcp.digitalWrite(DLC_RELAY_PINS[toolIndex], LOW); 
              delay(200);
              lcd.setCursor(0, 2); lcd.print("Waiting PC Command..");
            }
          }
        }
      }
      cmdIndex = 0; 
    }
  }
}

// ==========================================
// HÀM XỬ LÝ HTTPS OTA TỪ INTERNET (TỰ ĐỘNG GỌI LÚC BOOT)
// ==========================================
void updateFirmwareFromInternet() {
  lcd.clear();
  lcd.setCursor(0, 1); 
  lcd.print("Checking OTA...");

  if (WiFi.status() != WL_CONNECTED) {
    lcd.clear();
    lcd.setCursor(0, 1); 
    lcd.print("No WiFi Connection!");
    delay(1500);
    return;
  }


  WiFiClientSecure client;
  client.setInsecure(); // Bỏ qua kiểm tra chứng chỉ SSL

  HTTPClient http;
  http.begin(client, version_url);

  int httpCode = http.GET();

  if (httpCode != HTTP_CODE_OK) {
    lcd.clear();
    lcd.setCursor(0, 1); 
    lcd.print("Server Error: ");
    lcd.print(httpCode);
    delay(1500);
    http.end();
    return;
  }

  String payload = http.getString();

  JsonDocument doc;
  DeserializationError error = deserializeJson(doc, payload);

  if (error) {
    lcd.clear();
    lcd.setCursor(0, 1); 
    lcd.print("JSON Error!");
    delay(1500);
    http.end();
    return;
  }

  // Đọc version từ JSON:
  // {
  //   "version": "03.00.01",
  //   "version_code": 30001,
  //   "bin_file": "ESP32_3USB_3DLC_OTA_v03.00.01.bin"
  // }
  const char* new_version = doc["version"] | "";
  uint32_t new_version_code = doc["version_code"] | 0;
  const char* bin_file_name = doc["bin_file"] | "";

  // Kiểm tra JSON có đủ dữ liệu bắt buộc hay không
  if (new_version_code == 0 || strlen(new_version) == 0 || strlen(bin_file_name) == 0) {
    lcd.clear();
    lcd.setCursor(0, 0); 
    lcd.print("Invalid version.json");
    lcd.setCursor(0, 1); 
    lcd.print("Missing data!");
    delay(2000);
    http.end();
    return;
  }

  // Debug ra USB Serial để dễ kiểm tra khi cần
  USBSerial.print("Current Version: ");
  USBSerial.println(CURRENT_VERSION);
  USBSerial.print("Current Version Code: ");
  USBSerial.println(CURRENT_VERSION_CODE);
  USBSerial.print("Server Version: ");
  USBSerial.println(new_version);
  USBSerial.print("Server Version Code: ");
  USBSerial.println(new_version_code);

  // Chỉ OTA khi VERSION_CODE trên server lớn hơn VERSION_CODE hiện tại
  if (new_version_code > CURRENT_VERSION_CODE) {
    lcd.clear();
    lcd.setCursor(0, 0); 
    lcd.print("New Version Found!");

    lcd.setCursor(0, 1); 
    lcd.print("Current V: "); 
    lcd.print(CURRENT_VERSION);

    lcd.setCursor(0, 2); 
    lcd.print("New V:     "); 
    lcd.print(new_version);

    lcd.setCursor(0, 3); 
    lcd.print("Downloading FW...");

    String full_bin_url = String(base_bin_url) + String(bin_file_name);

    // Kết thúc HTTP request version.json trước khi download file BIN
    http.end();

    t_httpUpdate_return ret = httpUpdate.update(client, full_bin_url);

    switch (ret) {
      case HTTP_UPDATE_FAILED:
        lcd.clear();
        lcd.setCursor(0, 0); 
        lcd.print("Update Failed!");

        lcd.setCursor(0, 1); 
        lcd.print("Error: ");
        lcd.print(httpUpdate.getLastError());

        lcd.setCursor(0, 2); 
        lcd.print(httpUpdate.getLastErrorString());
        delay(3000);
        break;

      case HTTP_UPDATE_NO_UPDATES:
        lcd.clear();
        lcd.setCursor(0, 1); 
        lcd.print("No Update Needed");
        delay(1500);
        break;

      case HTTP_UPDATE_OK:
        // ESP32 HTTPUpdate thường tự restart sau khi update thành công.
        // Đoạn dưới vẫn giữ để hiển thị trạng thái nếu thư viện trả về.
        lcd.clear();
        lcd.setCursor(0, 1); 
        lcd.print("Update Success!");
        lcd.setCursor(0, 2); 
        lcd.print("Rebooting...");
        delay(1000);
        ESP.restart();
        break;
    }
  } 
  else {
    // VERSION_CODE bằng hoặc nhỏ hơn firmware hiện tại -> KHÔNG download
    lcd.clear();
    lcd.setCursor(0, 0); 
    lcd.print("Already Up To Date!");

